title: Apache Failed Login Attempt
id: 5a710c80-8a00-11ee-b9d1-0242ac120002
description: Detects a failed login attempt in Apache logs.
logsource:
    category: web
    product: apache
detection:
    selection:
        - "authentication_failure"
    condition: selection
falsepositives:
    - Normal user mistypes
level: medium
