title: Apache suspicious admin paths
id: 7e2ce055-aecb-4e14-aeef-c4ca14b3e068
description: Detects suspicious admin paths in Apache logs.
logsource:
    category: web
    product: apache
detection:
    selection:
        request:
            - '/admin'
            - '/wp-admin'
            - '/phpmyadmin'
    condition: selection
falsepositives:
    - Legitimate admin access
level: high